In [3]:
import csv
import pandas as pd

In [37]:


with open('book_store.csv','w',newline='') as f:
    writer=csv.writer(f)
    writer.writerow(['book_name','category','price','quantity'])
    writer.writerow(['book1','tech',230,5])
    writer.writerow(['book2','AI',230,5])
    writer.writerow(['book3','medicine',230,5])
    writer.writerow(['book4','cs',230,5])
    writer.writerow(['book4','ds',230,5])

In [38]:
df=pd.read_csv('book_store.csv')
df

  book_name  category  price  quantity
0     book1      tech    230         5
1     book2        AI    230         5
2     book3  medicine    230         5
3     book4        cs    230         5
4     book4        ds    230         5

In [83]:
option=input('\t \t welcome to our library system \n options: (1) Admin \ (2) user \ (3) Exit\n \t ur option: ')
if option =='1':
    if input('username: ') =='Admin23' and input('Password: ')=='123DS':
        
        opt=input('\t 1-get all the data \n \t 2-get the books \n \t 3- add book \n \t 4-delete book \n \t 5-get the stats\n \t \t ur option:  ')
        if opt=='1':
            print(df)
        elif opt=='2':
            print(df['book_name'].values)
        elif opt=='3':
            book_name=input('\t let\'s add a book \n \t enter ur book name: ')
            if book_name in df['book_name'].values:
                index=df[df['book_name']=='book3'].index[0]
                df.loc[index,'quantity']+=1
            else:
                cat=input('categ: ')
                price=float('price: ')
                quant=int('quant: ')
                df.loc[df.shape[0]]=[book_name,cat,price,quant]
        elif opt=='4':
            book_name=input('book name: ')
            df.drop(df[df['book_name']==book_name].index[0],axis=0,inplace=True)
        elif opt=='5':
            print(df.describe())
elif option == '2':
    username=input('username: ')
    password=input('password: ')
    book_name=input('bookname: ')
    if  book_name in df['book_name'].values:
        print(df[df['book_name']==book_name])
        if input('would u buy this book? (y/n): ') =='y':
            if df[df['book_name']==book_name]['quantity'].values[0] >1:
                df.loc[df[df['book_name']==book_name].index[0],'quantity']-=1
            else:
                df.drop(df[df['book_name']==book_name].index[0],axis=0,inplace=True)
                
    else:
        print('not found')

	 	 welcome to our library system
 options: (1) Admin \ (2) user \ (3) Exit
 	 ur option: 2
username: sdfd
password: 232
bookname: book1
  book_name category  price  quantity
0     book1     tech    230         5
would u buy this book? (y/n): y

In [84]:
df

  book_name category  price  quantity
0     book1     tech    230         4
1     book2       AI    230         5
3     book4       cs    230         5
4     book4       ds    230         5
5     book5       dd    222         4

In [8]:
print(df['book_name'].values)

['book1' 'book2' 'book3' 'book4']

In [9]:
3 in [2,4,5,1,7]

False

In [23]:
df.loc[0,'price']+=20
df

  book_name  category  price  quantity
0     book1      tech    250         5
1     book2        AI    230         5
2     book3  medicine    230         5
3     book4        cs    230         5

In [18]:
df['price']

0    230
1    230
2    230
3    230
Name: price, dtype: int64

In [24]:
df

  book_name  category  price  quantity
0     book1      tech    250         5
1     book2        AI    230         5
2     book3  medicine    230         5
3     book4        cs    230         5

In [30]:
df2=pd.read_csv('book_store.csv')
df2

  book_name  category  price  quantity
0     book1      tech    250         5
1     book2        AI    230         5
2     book3  medicine    230         5
3     book4        cs    230         5

In [28]:
df

  book_name  category  price  quantity
0     book1      tech    250         5
1     book2        AI    230         5
2     book3  medicine    230         5
3     book4        cs    230         5

In [29]:
df.to_csv('book_store.csv',index=False)

In [31]:
df.loc[0,'quantity']

5

In [36]:
df[df['book_name']=='book3' and ].index[0]

2

In [49]:
df[(df['book_name']=='book4') | (df['category']=='ds')]

  book_name category  price  quantity
3     book4       cs    230         5
4     book4       ds    230         5

In [51]:
df[(df['category']!='ds')]

  book_name  category  price  quantity
0     book1      tech    230         5
1     book2        AI    230         5
2     book3  medicine    230         5
3     book4        cs    230         5

In [55]:
index=df[df['book_name']=='book3'].index[0]
df.loc[index,'quantity']+=1
df

  book_name  category  price  quantity
0     book1      tech    230         5
1     book2        AI    230         5
2     book3  medicine    230         6
3     book4        cs    230         5
4     book4        ds    230         5

ValueError: cannot set a row with mismatched columns

In [57]:
df

  book_name  category  price  quantity
0     book1      tech    230         5
1     book2        AI    230         5
2     book3  medicine    230         6
3     book4        cs    230         5
4     book4        ds    230         5
5     book5        dd    222         4

In [60]:
df.shape

(6, 4)

In [62]:
df

  book_name  category  price  quantity
0     book1      tech    230         5
1     book2        AI    230         5
2     book3  medicine    230         6
3     book4        cs    230         5
4     book4        ds    230         5
5     book5        dd    222         4

In [63]:
len(df)

6

In [68]:
df.drop(df[df['book_name']=='book3'].index[0],axis=0,inplace=True)

In [69]:
df

  book_name category  price  quantity
0     book1     tech    230         5
1     book2       AI    230         5
3     book4       cs    230         5
4     book4       ds    230         5
5     book5       dd    222         4

In [71]:
df.drop(df[df['book_name']=='book4'].index,axis=0)

  book_name category  price  quantity
0     book1     tech    230         5
1     book2       AI    230         5
5     book5       dd    222         4

In [72]:
df

  book_name category  price  quantity
0     book1     tech    230         5
1     book2       AI    230         5
3     book4       cs    230         5
4     book4       ds    230         5
5     book5       dd    222         4

In [73]:
df.describe()

            price  quantity
count    5.000000  5.000000
mean   228.400000  4.800000
std      3.577709  0.447214
min    222.000000  4.000000
25%    230.000000  5.000000
50%    230.000000  5.000000
75%    230.000000  5.000000
max    230.000000  5.000000

In [80]:
 if df[df['book_name']=='book5']['quantity'].values[0] >1:

4

## Modules

In [85]:
import md

In [86]:
md.spy_game([12,3,5,0,123,23,0,7])

True

In [87]:
from md import spy_game

In [88]:
spy_game([12,3,5,0,123,23,0,7])

True

In [3]:
from md import got33

In [4]:
got33([1,2,3,3,4,5])

True

In [5]:
import md

In [6]:
from md import *

In [10]:
import lib

In [12]:
lib.md.got33([1,2,3,3,4,5])

True

In [13]:
from lib import *

In [14]:
import random

In [15]:
type(random)

module

In [16]:
random.randint(2,55)

30

In [19]:
random.choice([2,'33',7,4])

'33'

In [23]:
l=[2,'33',7,4]
random.shuffle(l)

In [24]:
l

[7, 4, '33', 2]

In [25]:
random.uniform(3,9)

6.442906126790424

In [26]:
import time

In [32]:
for i in range(2,99):
    print(i)
    time.sleep(3)

2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23

KeyboardInterrupt:

In [37]:
time.time

In [ ]:
l=[344,6,8]
time.sleep(2)

In [42]:
time.time() #seconds 1/1/1970

1683979240.94167

In [47]:
start=time.time()
for i in range(99):
    pass
finish=time.time()
print((finish-start))

0.0009915828704833984

In [53]:
from datetime import datetime ,timedelta

In [60]:
dt1=datetime.now()

In [55]:
datetime_

datetime.datetime(2023, 5, 13, 14, 42, 34, 928575)

In [61]:
dt2=datetime(2022,5,23,5)

In [57]:
datet_

datetime.datetime(2022, 5, 23, 5, 0)

In [58]:
datetime_.day

13

In [59]:
datet_.day

23

In [62]:
dt1.day

13

In [63]:
dt1.year

2023

In [64]:
dt1.month

5

In [65]:
dt1.hour

14

In [66]:
dt1.microsecond

355900

In [67]:
dt1

datetime.datetime(2023, 5, 13, 14, 45, 11, 355900)

In [70]:
dt3=datetime(2024,5,13,14,45,11)

In [72]:
dt3.year==dt1.year

False

In [73]:
dt=datetime.now()

In [85]:
(dt3-dt)/timedelta(weeks=1)

52.285395653030754

In [79]:
dt_new=datetime(dt.year+2,dt.month,dt.day,dt.hour,dt.minute,dt.second,dt.microsecond)

In [80]:
dt,dt_new

(datetime.datetime(2023, 5, 13, 14, 48, 23, 709047),
 datetime.datetime(2025, 5, 13, 14, 48, 23, 709047))

In [86]:
import os

In [90]:
os.listdir('Thanos project/universe')

['cover001.png',
 'cover002.png',
 'cover003.png',
 'cover004.png',
 'cover005.png',
 'cover006.png',
 'cover007.png',
 'cover008.png',
 'cover009.png',
 'cover010.png',
 'cover011.png',
 'cover012.png',
 'cover013.png',
 'cover014.png',
 'cover015.png',
 'cover016.png',
 'cover017.png',
 'cover018.png',
 'cover019.png',
 'cover020.png',
 'cover021.png',
 'cover022.png',
 'cover023.png',
 'cover024.png',
 'cover025.png',
 'cover026.png',
 'cover027.png',
 'cover028.png',
 'cover029.png',
 'cover030.png',
 'cover031.png',
 'cover032.png',
 'cover033.png',
 'cover034.png',
 'cover035.png',
 'cover036.png',
 'cover037.png',
 'cover038.png',
 'cover039.png',
 'cover040.png',
 'cover041.png',
 'cover042.png',
 'cover043.png',
 'cover044.png',
 'cover045.png',
 'cover046.png',
 'cover047.png',
 'cover048.png',
 'cover049.png',
 'cover050.png']

In [91]:
os.listdir('.')

['.ipynb_checkpoints',
 'Assignment.txt',
 'book_store.csv',
 'content.txt',
 'Ecommerce Purchases.csv',
 'Function Assignment .ipynb',
 'lib',
 'md.py',
 'OOP.pptx',
 'Rock_Paper_Scissor_game_Template.ipynb',
 'Thanos project',
 'Untitled.ipynb',
 '__pycache__']

In [92]:
os.chdir('../')

In [93]:
os.listdir('.')

['CDSEP Content.pdf',
 'Session 1',
 'Session 2',
 'Session 3',
 'Session 4',
 'Session 5',
 'Session 6',
 'Session 7',
 'Session 8',
 'Session 9']

In [95]:
os.listdir('Session 9/')

['.ipynb_checkpoints',
 'Assignment.txt',
 'book_store.csv',
 'content.txt',
 'Ecommerce Purchases.csv',
 'Function Assignment .ipynb',
 'lib',
 'md.py',
 'OOP.pptx',
 'Rock_Paper_Scissor_game_Template.ipynb',
 'Thanos project',
 'Untitled.ipynb',
 '__pycache__']

In [96]:
os.chdir('Session 9/')

In [97]:
os.listdir('.')

['.ipynb_checkpoints',
 'Assignment.txt',
 'book_store.csv',
 'content.txt',
 'Ecommerce Purchases.csv',
 'Function Assignment .ipynb',
 'lib',
 'md.py',
 'OOP.pptx',
 'Rock_Paper_Scissor_game_Template.ipynb',
 'Thanos project',
 'Untitled.ipynb',
 '__pycache__']

In [99]:
os.mkdir('folder1/ff1')

In [102]:
os.removedirs('folder1/ff1')

In [104]:
os.listdir('.')

['.ipynb_checkpoints',
 'Assignment.txt',
 'book_store.csv',
 'content.txt',
 'Ecommerce Purchases.csv',
 'Function Assignment .ipynb',
 'lib',
 'md.py',
 'OOP.pptx',
 'Rock_Paper_Scissor_game_Template.ipynb',
 'Thanos project',
 'Untitled.ipynb',
 '__pycache__']

In [105]:
os.remove('thanos.jpg')